{
  "order": 3,
  "title": "Beat Catalogue",
  "descriptionEs": "Plataforma de catálogo musical para productor independiente especializado en beats instrumentales, mixing y mastering.\n\nFrontend con SvelteKit implementando arquitectura híbrida: páginas individuales SSR para SEO óptimo + modal overlay client-side para UX fluida tipo Spotify. Backend FastAPI + PostgreSQL (Neon) con admin panel personalizado para gestión completa de playlists, tracks y configuración dinámica.\n\nSistema de proxy interno para resolver CORS en navegación desde Google móvil. Integración con Cloudinary para almacenamiento y delivery de audio/imágenes por género.\n\nFeatures: reproductor de audio completo con shuffle inteligente, contador de plays con tracking API, newsletter float widget, theme switcher dark/light persistente, brand colors dinámicos desde dashboard, sitemap XML auto-generado, meta tags dinámicos OpenGraph/Twitter/Schema.org (MusicPlaylist).\n\nStack: TypeScript, Svelte, Tailwind CSS, Axios, Three.js (logo 3D + efectos visuales), FastAPI, SQLAlchemy, Cloudinary. Deploy dual: Frontend en Fly.io, Backend en Fly.io con PostgreSQL en Neon.",
  "descriptionEn": "Music catalogue platform for independent producer specialized in instrumental beats, mixing and mastering.\n\nFrontend with SvelteKit implementing hybrid architecture: individual SSR pages for optimal SEO + client-side modal overlay for Spotify-like fluid UX. FastAPI + PostgreSQL (Neon) backend with custom admin panel for complete management of playlists, tracks and dynamic configuration.\n\nInternal proxy system to resolve CORS in navigation from Google mobile. Cloudinary integration for audio/image storage and delivery by genre.\n\nFeatures: complete audio player with intelligent shuffle, play counter with API tracking, newsletter float widget, persistent dark/light theme switcher, dynamic brand colors from dashboard, auto-generated XML sitemap, dynamic meta tags OpenGraph/Twitter/Schema.org (MusicPlaylist).\n\nStack: TypeScript, Svelte, Tailwind CSS, Axios, Three.js (3D logo + visual effects), FastAPI, SQLAlchemy, Cloudinary. Dual deployment: Frontend on Fly.io, Backend on Fly.io with PostgreSQL on Neon.",
  "image": "/images/beat400.webp",
  "link": "https://beastiec.site/",
  "tags": ["SvelteKit", "FastAPI", "PostgreSQL", "Three.js", "Cloudinary"]
}
