{
  "order": 1,
  "title": "Qubly CRM",
  "descriptionEs": "Plataforma SaaS para pequeños negocios en México que permite crear una tienda online en 15 minutos con pedidos directos a WhatsApp, sin comisiones por venta. Sistema completo de e-commerce con suscripciones recurrentes, chatbot con IA, sistema de referidos y dashboard administrativo multi-tenant.\n\nFrontend con SvelteKit implementando arquitectura híbrida: páginas estáticas pre-renderizadas para SEO óptimo, rutas dinámicas SSR para tiendas públicas con meta tags dinámicos (OpenGraph, Twitter Cards, Schema.org), y componentes client-side reactivos para interactividad. PWA completa con manifest.json, service worker, y botón de instalación inteligente que detecta plataforma y navegador (iOS Safari, Android Chrome, Desktop Chrome/Edge/Firefox) para ofrecer instalación directa o instrucciones específicas por dispositivo. Sistema de diseño responsive mobile-first con Tailwind CSS, componentes modulares reutilizables (Input, Button, Icon, Chatbot, InstallButton), y manejo de estado con Svelte stores (auth, cart, business).\n\nBackend en Go con Fiber framework implementando Clean Architecture: separación en capas (handlers → services → repositories), dependency injection con interfaces para testabilidad, middleware personalizado (autenticación JWT, autorización admin, rate limiting, error handling centralizado, caché de respuestas públicas con TTL configurable). Base de datos PostgreSQL (Neon serverless) con GORM ORM, migraciones automáticas, soft delete, índices optimizados, y relaciones foreign key para integridad referencial. Sistema de caché en memoria para analytics y métricas con TTL de 5 minutos, reduciendo carga en base de datos.\n\nIntegración completa con Stripe para pagos: suscripciones recurrentes ($249 MXN/mes) con webhooks para sincronización de estados (checkout.session.completed, customer.subscription.updated, customer.subscription.deleted, invoice.payment_succeeded/failed), Stripe Connect para pagos de pedidos de clientes, state machine para validar transiciones de suscripción (trial → active → past_due → cancelled), y manejo de períodos de prueba con expiración automática. Sistema de referidos con códigos únicos (formato QUBLY####), límite anual de 3 referidos exitosos por negocio, descuentos automáticos para referidor y referido al completar primera suscripción, y tracking completo de referrals con estados (pending, successful, failed).\n\nChatbot con IA integrado usando Groq API (modelo Llama) con optimización TOON (Token Oriented Object Notation): construcción de contexto en formato string compacto en lugar de JSON para reducir tokens y costos de API, límites adaptativos de productos y reseñas según intención detectada (10 productos por defecto, expansión hasta 50 para intenciones de exploración), truncado inteligente de descripciones (60 caracteres para productos, 100 para comentarios), y prompts optimizados con system prompt y user prompt separados para evitar redundancia. Detección de intención automática (producto, precio, entrega, pago, reseñas), construcción de contexto dinámico con información del negocio (productos activos, reseñas aprobadas, configuración), sistema de caché de respuestas para reducir llamadas a API, logging completo de eventos de chatbot para analytics, y métricas avanzadas (total interacciones, cache hit rate, tiempo promedio de respuesta, breakdown por intención, queries no cubiertos). Widget de chatbot flotante con tema personalizable por negocio, animaciones suaves, y manejo robusto de eventos en móvil para prevenir cierre accidental del modal.\n\nSistema de comentarios y reseñas con moderación: estrellas (1-5), aprobación manual por admin, paginación (12 por página), visualización en tienda pública, y cálculo automático de promedio. Dashboard administrativo multi-tenant con métricas separadas (Platform Metrics para Qubly como negocio, Customer Metrics para tiendas de clientes), analytics en tiempo real con caché inteligente, gráficos con Chart.js (registros semanales, revenue mensual, breakdown por status), gestión completa de usuarios (listar, crear, invitar, actualizar, cambiar contraseña), y sistema de roles (super_admin, admin_viewer).\n\nFeatures destacados: landing page con 7 secciones (hero, beneficios, comparativa Rappi/Uber Eats vs Qubly, testimonios, FAQ, CTA), registro con verificación de email vía Resend, dashboard de negocio con estadísticas (total pedidos, revenue, productos activos), gestión completa de productos y categorías con ordenamiento personalizable, tienda pública con carrito persistente en localStorage, checkout con generación automática de links de WhatsApp formateados, sistema de órdenes con estados (pending, confirmed, completed, cancelled), SEO optimizado con meta tags dinámicos por tienda, sitemap XML auto-generado, robots.txt configurable, y sistema de limpieza automática de datos de prueba con jobs programados.\n\nOptimizaciones: multi-stage Docker builds para imágenes optimizadas, compresión automática de respuestas HTTP vía Fly.io proxy edge, lazy loading de imágenes, dynamic imports para reducir bundle inicial, eliminación de console.log en producción vía esbuild, y sistema de health checks para monitoreo. Arquitectura offline-first con assets locales, fuentes self-hosted (Inter Variable), y sistema de iconos SVG (Phosphor Icons) integrado.\n\nStack: TypeScript, SvelteKit, Go 1.21, Fiber v2, PostgreSQL (Neon), GORM, Stripe API, Groq API, Resend, Cloudinary, Tailwind CSS, Chart.js, Docker, Fly.io. Deploy automatizado en Fly.io con zero-downtime, variables de entorno inyectadas en build-time para frontend (VITE_), y configuración dual dev/prod con detección automática de entorno.",
  "descriptionEn": "SaaS platform for small businesses in Mexico that allows creating an online store in 15 minutes with direct orders to WhatsApp, without sales commissions. Complete e-commerce system with recurring subscriptions, AI chatbot, referral system and multi-tenant administrative dashboard.\n\nFrontend with SvelteKit implementing hybrid architecture: pre-rendered static pages for optimal SEO, dynamic SSR routes for public stores with dynamic meta tags (OpenGraph, Twitter Cards, Schema.org), and reactive client-side components for interactivity. Complete PWA with manifest.json, service worker, and intelligent installation button that detects platform and browser (iOS Safari, Android Chrome, Desktop Chrome/Edge/Firefox) to offer direct installation or device-specific instructions. Mobile-first responsive design system with Tailwind CSS, modular reusable components (Input, Button, Icon, Chatbot, InstallButton), and state management with Svelte stores (auth, cart, business).\n\nBackend in Go with Fiber framework implementing Clean Architecture: layer separation (handlers → services → repositories), dependency injection with interfaces for testability, custom middleware (JWT authentication, admin authorization, rate limiting, centralized error handling, public response caching with configurable TTL). PostgreSQL database (Neon serverless) with GORM ORM, automatic migrations, soft delete, optimized indexes, and foreign key relationships for referential integrity. In-memory cache system for analytics and metrics with 5-minute TTL, reducing database load.\n\nComplete Stripe integration for payments: recurring subscriptions ($249 MXN/month) with webhooks for state synchronization (checkout.session.completed, customer.subscription.updated, customer.subscription.deleted, invoice.payment_succeeded/failed), Stripe Connect for customer order payments, state machine to validate subscription transitions (trial → active → past_due → cancelled), and trial period handling with automatic expiration. Referral system with unique codes (QUBLY#### format), annual limit of 3 successful referrals per business, automatic discounts for referrer and referred upon completing first subscription, and complete referral tracking with states (pending, successful, failed).\n\nAI chatbot integrated using Groq API (Llama model) with TOON optimization (Token Oriented Object Notation): context construction in compact string format instead of JSON to reduce tokens and API costs, adaptive limits for products and reviews based on detected intent (10 products by default, expansion up to 50 for exploration intents), intelligent description truncation (60 characters for products, 100 for comments), and optimized prompts with separate system prompt and user prompt to avoid redundancy. Automatic intent detection (product, price, delivery, payment, reviews), dynamic context construction with business information (active products, approved reviews, configuration), response caching system to reduce API calls, complete chatbot event logging for analytics, and advanced metrics (total interactions, cache hit rate, average response time, breakdown by intent, uncovered queries). Floating chatbot widget with customizable theme per business, smooth animations, and robust mobile event handling to prevent accidental modal closure.\n\nComments and reviews system with moderation: stars (1-5), manual approval by admin, pagination (12 per page), public store display, and automatic average calculation. Multi-tenant administrative dashboard with separated metrics (Platform Metrics for Qubly as business, Customer Metrics for client stores), real-time analytics with intelligent caching, charts with Chart.js (weekly records, monthly revenue, breakdown by status), complete user management (list, create, invite, update, change password), and role system (super_admin, admin_viewer).\n\nKey features: landing page with 7 sections (hero, benefits, Rappi/Uber Eats vs Qubly comparison, testimonials, FAQ, CTA), registration with email verification via Resend, business dashboard with statistics (total orders, revenue, active products), complete product and category management with customizable ordering, public store with persistent cart in localStorage, checkout with automatic generation of formatted WhatsApp links, order system with states (pending, confirmed, completed, cancelled), optimized SEO with dynamic meta tags per store, auto-generated XML sitemap, configurable robots.txt, and automatic test data cleanup system with scheduled jobs.\n\nOptimizations: multi-stage Docker builds for optimized images, automatic HTTP response compression via Fly.io proxy edge, lazy loading of images, dynamic imports to reduce initial bundle, console.log removal in production via esbuild, and health check system for monitoring. Offline-first architecture with local assets, self-hosted fonts (Inter Variable), and integrated SVG icon system (Phosphor Icons).\n\nStack: TypeScript, SvelteKit, Go 1.21, Fiber v2, PostgreSQL (Neon), GORM, Stripe API, Groq API, Resend, Cloudinary, Tailwind CSS, Chart.js, Docker, Fly.io. Automated deployment on Fly.io with zero-downtime, environment variables injected at build-time for frontend (VITE_), and dual dev/prod configuration with automatic environment detection.",
  "image": "/images/qubly400.webp",
  "link": "https://qublycrm.com/",
  "tags": ["SvelteKit", "TypeScript", "Go", "Fiber", "PostgreSQL", "Stripe", "Groq AI", "Resend", "Cloudinary", "PWA"]
}

