{
  "order": 3,
  "title": "Raccoonin Records",
  "descriptionEs": "Plataforma digital para label musical independiente.\n\nSitio web para promoción de lanzamientos musicales y contenido editorial. Migración completa de arquitectura CSR (Client-Side Rendering) a ISR (Incremental Static Regeneration) con Next.js 14 App Router, logrando renderizado híbrido con cache inteligente de 5 minutos.\n\nBackend headless CMS desarrollado con KeystoneJS 6 + PostgreSQL (Neon) para gestión de contenido editorial. Implementación de Server Components para data fetching optimizado con generateStaticParams() y Client Components selectivos para interactividad.\n\nSistema de posts con estados (featured/published), categorías públicas y páginas estáticas, todos con ISR. Features: hero carrusel de posts destacados con fetching server-side, grid infinito de posts con paginación, integración de embeds multimedia (Spotify/YouTube/Bandcamp) con lazy loading, metalinks automáticos a plataformas de streaming, logo 3D interactivo con Three.js/React Three Fiber, optimización de imágenes con Cloudinary CDN, sitemap XML dinámico con metadatos de imágenes.\n\nMonorepo con pnpm workspaces (apps/web-new + apps/cms). Optimizaciones: fuentes Inter self-hosted con preload, dynamic imports para reducir bundle inicial, loading states para cold starts en Fly.io.\n\nStack: TypeScript, Next.js 14, React 18, Tailwind CSS, GraphQL (urql), KeystoneJS 6, PostgreSQL, Cloudinary, Three.js, Docker. Deploy automatizado en Fly.io.",
  "descriptionEn": "Digital platform for independent music label.\n\nWebsite for music releases promotion and editorial content. Complete migration from CSR (Client-Side Rendering) to ISR (Incremental Static Regeneration) architecture with Next.js 14 App Router, achieving hybrid rendering with intelligent 5-minute cache.\n\nHeadless CMS backend developed with KeystoneJS 6 + PostgreSQL (Neon) for editorial content management. Server Components implementation for optimized data fetching with generateStaticParams() and selective Client Components for interactivity.\n\nPost system with states (featured/published), public categories and static pages, all with ISR. Features: hero carousel of featured posts with server-side fetching, infinite posts grid with pagination, multimedia embeds integration (Spotify/YouTube/Bandcamp) with lazy loading, automatic metalinks to streaming platforms, interactive 3D logo with Three.js/React Three Fiber, image optimization with Cloudinary CDN, dynamic XML sitemap with image metadata.\n\nMonorepo with pnpm workspaces (apps/web-new + apps/cms). Optimizations: self-hosted Inter fonts with preload, dynamic imports to reduce initial bundle, loading states for Fly.io cold starts.\n\nStack: TypeScript, Next.js 14, React 18, Tailwind CSS, GraphQL (urql), KeystoneJS 6, PostgreSQL, Cloudinary, Three.js, Docker. Automated deployment on Fly.io.",
  "image": "/images/rr400.webp",
  "link": "https://raccooninrecords.site/",
  "tags": ["Next.js", "TypeScript", "KeystoneJS", "PostgreSQL", "Three.js"]
}
